class Language:
    SANTA = "santa"
    SANTA_SUCKS = "santa_sucks"

class MessageSanta:
    GROUP_CHAT_NOTICE = """\
Так-так, бачу це груповий чат.

Перейдіть всі в @test_everything2_bot, пишіть /start і йдіть за інструкціями.

Можете написати /participants щоби отримати список тих хто вже зареєструвався.

Коли всі будуть готові, пишіть /assign в цьому чаті.
"""
    WELCOME = """\
Привіт, {}!

Вітаю в Боті для Таємного... Якщо ви микита, перед початком виконайте команду /santa_sucks

Якщо є бажання змінити ім'я - пиши /name <Нове Ім'я>, наприклад:
/name ВеселаПіпірка
Тільки щоби понятно було, хто ти, ок?

Коли готовий - пиши /register
"""
    ASSIGNMENT = "{}, Цього року ви Таємний Санта для {}!"

class MessageSantaSucks(MessageSanta):

    ASSIGNMENT = "{}, Цього роки ви Таємний Друг для {}! Скажу по секрету лише тобі, Микита лох."
