class Language:
    SANTA = "santa"
    SANTA_SUCKS = "santa_sucks"

class MessageSanta:
    GROUP_CHAT_NOTICE = """\
Так-так, бачу це груповий чат.

Перейдіть всі в @test_everything2_bot, пишіть /start і йдіть за інструкціями.

Можете написати /participants щоби отримати список тих хто вже зареєструвався.

Коли всі будуть готові, пишіть /assign в цьому чаті, щоби роздати ролі в особисті.
"""
    WELCOME = """\
Привіт, {}!

Вітаю в Боті для Таємного... Якщо ви микита, виконайте команду /santa_sucks

Додаю те бе в список учасників. Якщо захочеш вийти - пиши /leave

Якщо є бажання змінити ім'я - пиши /name <Нове Ім'я>, наприклад:
/name ВеселаПіпірка
Тільки щоби понятно було, хто ти, ок?

Тепер чекаємо поки всі приєднаються!
"""
    ASSIGNMENT = "{}, Цього року ви Таємний Санта для {}!"
    NOT_REGISTERED = "Ви не зареєстровані. Спочатку виконайте /start"
    LEFT = "Ти більше не приймаєш участі в Таємному Cанті. Пиши /register, якщо захочеш повернутися."

class MessageSantaSucks(MessageSanta):

    ASSIGNMENT = "{}, Цього роки ви Таємний Друг для {}! Скажу по секрету лише тобі, Микита лох."
    LEFT = "Ти більше не приймаєш участі в Таємному Другові Пиши /register, якщо захочеш повернутися."
